84_7ms_Mesh1/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  12
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

6
(
    inlet
    {
        type            patch;
        nFaces          240;
        startFace       200760;
    }
    outlet
    {
        type            patch;
        nFaces          240;
        startFace       201000;
    }
    lowerWall
    {
        type            symmetryPlane;
        inGroups        List<word> 1(symmetryPlane);
        nFaces          360;
        startFace       201240;
    }
    upperWall
    {
        type            symmetryPlane;
        inGroups        List<word> 1(symmetryPlane);
        nFaces          360;
        startFace       201600;
    }
    pipe
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          480;
        startFace       201960;
    }
    defaultFaces
    {
        type            empty;
        inGroups        List<word> 1(empty);
        nFaces          201600;
        startFace       202440;
    }
)

// ************************************************************************* //
