84_7ms_Mesh1/system/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  12
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

ddtSchemes
{
    default         Euler;
}

gradSchemes
{
//    default         Gauss linear;
    default         cellMDLimited Gauss linear 0;
    grad(U)         cellMDLimited Gauss linear 0.333; 
}

divSchemes
{
    default             none;

    div(phi,U)          Gauss linearUpwind grad(U);
    div(U)              Gauss linear;
    div(phi,k)          Gauss linearUpwind default;
    div(phi,epsilon)    Gauss linearUpwind default;
    div(phi,R)          Gauss linearUpwind default;
    div(phi,omega)      Gauss linearUpwind default;
    div(R)              Gauss linear;
    div(phi,nuTilda)    Gauss upwind;

    div((nuEff*dev2(T(grad(U))))) Gauss linear;
}

laplacianSchemes
{
    default         Gauss linear limited 1.0;
}

interpolationSchemes
{
    default         linear;
}

snGradSchemes
{
    default         limited 1.0;
}


wallDist
{
    method          meshWave;
}


// ************************************************************************* //
